
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДокументыДоговорыПоПараметрам();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыДоговорыПоПараметрам()
	
	ДокументыДоговоры.Очистить();
	
	Для каждого элементДляОбработки Из Параметры.МассивДокументовДляПостОбработки Цикл
	
		новаяСтрока = ДокументыДоговоры.Добавить();
		новаяСтрока.ДокументСсылка = элементДляОбработки.ДокументСсылка;
		новаяСтрока.ДоговорСсылка = новаяСтрока.ДокументСсылка.ДоговорКонтрагента;
			
		Для каждого договорСсылка Из элементДляОбработки.Параметры.массивВозможныхДоговоров Цикл
		
			новаяСтрокаВозможныеДоговоры = ВозможныеДоговоры.Добавить();
			новаяСтрокаВозможныеДоговоры.ДокументСсылка = элементДляОбработки.ДокументСсылка;
			новаяСтрокаВозможныеДоговоры.договорСсылка = договорСсылка;
		
		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыДоговорыДоговорСсылкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", 
		Новый Структура("Отбор", 
			Новый Структура("Ссылка", ПолучитьВозможныеДоговорыДляДокумента(Элементы.ДокументыДоговоры.ТекущиеДанные.ДокументСсылка))), Элементы.ДокументыДоговорыДоговорСсылка,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыДоговорыДоговорСсылкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
	КонецЕсли;
	
	Элементы.ДокументыДоговоры.ТекущиеДанные.ДоговорСсылка = ВыбранноеЗначение;
		
КонецПроцедуры

&НаСервере
Процедура ПрименитьНаСервере()
	
	Для каждого элементДокументДоговор Из ДокументыДоговоры Цикл
	
		Если элементДокументДоговор.ДокументСсылка.ДоговорКонтрагента = элементДокументДоговор.ДоговорСсылка Тогда
			Продолжить;
		КонецЕсли;
		
		
		Попытка
			документОбъект = элементДокументДоговор.ДокументСсылка.ПолучитьОбъект();
			документОбъект.ДоговорКонтрагента = элементДокументДоговор.ДоговорСсылка;
			документОбъект.Записать();
		Исключение
			Сообщить("Не удалось изменить договор для документа: " + элементДокументДоговор.ДокументСсылка);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	ПрименитьНаСервере();
	Закрыть();
	
КонецПроцедуры

//{ Вспомогательные

&НаСервере
Функция ПолучитьВозможныеДоговорыДляДокумента(ДокументСсылка)
	
	результат = Новый Массив;
	строкиДоговоров = ВозможныеДоговоры.НайтиСтроки(Новый Структура("ДокументСсылка", ДокументСсылка));
	
	Для каждого строкаДоговора Из строкиДоговоров Цикл
	
		результат.Добавить(строкаДоговора.ДоговорСсылка);
	
	КонецЦикла;
	
	Возврат результат;
	
КонецФункции

//}